wayne-love/sn_esp32/src/main.cpp
  //climateADPublish(mqttClient, spa, spaName, "{{ value_json.temperatures }}", "Heating");
  config.displayName = spaName;
  config.valueTemplate = "{{ value_json.temperatures }}";
  config.propertyId = "Heating";
  config.deviceClass = "";
  config.entityCategory = "";
  generateClimateAdJSON(output, config, spa, discoveryTopic);
  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  //selectADPublish(mqttClient, spa, "Heatpump Mode", "{{ value_json.heatpump.mode }}", "heatpump_mode", "", "", {"Auto","Heat","Cool","Off"});
  config.displayName = "Heatpump Mode";
  config.valueTemplate = "{{ value_json.heatpump.mode }}";
  config.propertyId = "heatpump_mode";
  config.deviceClass = "";
  config.entityCategory = "";
  generateSelectAdJSON(output, config, spa, discoveryTopic, si.HPMPStrings);
  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);


  config.deviceClass = "";
  config.entityCategory = "";
  if (si.getPump1InstallState().startsWith("1") && !(si.getPump1InstallState().endsWith("4"))) {
     //switchADPublish(mqttClient, spa, "Pump 1", "{{ value_json.pumps.pump1.state }}", "pump1");
    config.displayName = "Pump 1";
    config.valueTemplate = "{{ value_json.pumps.pump1.state }}";
    config.propertyId = "pump1";
    generateSwitchAdJSON(output, config, spa, discoveryTopic);
    mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);
  }

  if (si.getPump2InstallState().startsWith("1") && !(si.getPump2InstallState().endsWith("4"))) {
    //switchADPublish(mqttClient, spa, "Pump 2","{{ value_json.pumps.pump2.state }}", "pump2");
    config.displayName = "Pump 2";
    config.valueTemplate = "{{ value_json.pumps.pump2.state }}";
    config.propertyId = "pump2";
    generateSwitchAdJSON(output, config, spa, discoveryTopic);
    mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);
  }

  if (si.getPump3InstallState().startsWith("1") && !(si.getPump3InstallState().endsWith("4"))) {
    //switchADPublish(mqttClient, spa, "Pump 3", "{{ value_json.pumps.pump3.state }}", "pump3");
    config.displayName = "Pump 3";
    config.valueTemplate = "{{ value_json.pumps.pump3.state }}";
    config.propertyId = "pump3";
    generateSwitchAdJSON(output, config, spa, discoveryTopic);
    mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);
  }

  if (si.getPump4InstallState().startsWith("1") && !(si.getPump4InstallState().endsWith("4"))) {
    //switchADPublish(mqttClient, spa, "Pump 4", "{{ value_json.pumps.pump4.state }}", "pump4");
    config.displayName = "Pump 4";
    config.valueTemplate = "{{ value_json.pumps.pump4.state }}";
    config.propertyId = "pump4";
    generateSwitchAdJSON(output, config, spa, discoveryTopic);
    mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);
  }

  if (si.getPump5InstallState().startsWith("1") && !(si.getPump5InstallState().endsWith("4"))) {
    //switchADPublish(mqttClient, spa, "Pump 5", "{{ value_json.pumps.pump5.state }}", "pump5");
    config.displayName = "Pump 5";
    config.valueTemplate = "{{ value_json.pumps.pump5.state }}";
    config.propertyId = "pump5";
    generateSwitchAdJSON(output, config, spa, discoveryTopic);
    mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  }

  //switchADPublish(mqttClient, spa, "Aux Heat Element", "{{ value_json.heatpump.auxheat }}", "heatpump_auxheat");
  config.displayName = "Aux Heat Element";
  config.valueTemplate = "{{ value_json.heatpump.auxheat }}";
  config.propertyId = "heatpump_auxheat";
  config.deviceClass = "";
  config.entityCategory = "";
  generateSwitchAdJSON(output, config, spa, discoveryTopic);
  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  //lightADPublish(mqttClient, spa, "Lights", "{{ value_json.lights }}", "lights", "", "", colorModeStrings);
  config.displayName = "Lights";
  config.valueTemplate = "{{ value_json.lights }}";
  config.propertyId = "lights";
  config.deviceClass = "";
  config.entityCategory = "";
  generateLightAdJSON(output, config, spa, discoveryTopic, si.colorModeStrings);
  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  //selectADPublish(mqttClient, spa, "Lights Speed","{{ value_json.lights.speed }}","lights_speed", "", "", {"1","2","3","4","5"});
  config.displayName = "Lights Speed";
  config.valueTemplate = "{{ value_json.lights.speed }}";
  config.propertyId = "lights_speed";
  config.deviceClass = "";
  config.entityCategory = "";
  generateSelectAdJSON(output, config, spa, discoveryTopic, si.lightSpeedMap );
  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  //selectADPublish(mqttClient, spa, "Sleep Timer 1","{{ value_json.sleepTimers.timer1.state }}", "sleepTimers_1_state", "config", "", sleepStrings);
  //selectADPublish(mqttClient, spa, "Sleep Timer 2","{{ value_json.sleepTimers.timer2.state }}", "sleepTimers_2_state", "config", "", sleepStrings);
  config.displayName = "Sleep Timer 1";
  config.valueTemplate = "{{ value_json.sleepTimers.timer1.state }}";
  config.propertyId = "sleepTimers_1_state";
  config.deviceClass = "";
  config.entityCategory = "config";
  generateSelectAdJSON(output, config, spa, discoveryTopic, si.sleepSelection);
  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  config.displayName = "Sleep Timer 2";
  config.valueTemplate = "{{ value_json.sleepTimers.timer2.state }}";
  config.propertyId = "sleepTimers_2_state";
  config.deviceClass = "";
  config.entityCategory = "config";
  generateSelectAdJSON(output, config, spa, discoveryTopic, si.sleepSelection);
  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  config.displayName = "Date Time";
  config.valueTemplate = "{{ value_json.status.datetime }}";
  config.propertyId = "status_datetime";
  config.deviceClass = "";
  config.entityCategory = "config";
  generateTextAdJSON(output, config, spa, discoveryTopic, "[0-9]{4}-[0-9]{2}-[0-9]{2} [0-9]{2}:[0-9]{2}");
  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

